[
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47381",
    "company": "APTech",
    "position": "Engineer Associate – Applied Pavement Technology",
    "link": "https://researchpark.illinois.edu/job/engineer-associate-applied-pavement-technology/",
    "posted_date": "Mon, 03 Nov 2025 20:59:02 +0000",
    "published_parsed": [
      2025,
      11,
      3,
      20,
      59,
      2,
      0,
      307,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2025/01/APT-2-150x150.jpg",
    "description": "About Applied Pavement Technology APTech is a full-service pavement engineering and transportation asset management consulting firm that provides effective solutions for the management of roadway and airport infrastructure. Since their founding in 1994, they have worked with clients at the state, federal, and local levels in the United States and abroad, and are a recognized leader in their industry. APTech helps clients identify cost-effective strategies that reduce the overall life-cycle cost of preserving their transportation networks while incorporating the latest management strategies and technologies into organizational practice. Please see the APTech Tenant Directory for more information. Applied Pavement Technology – Research Park About the Role APTech has immediate openings for hard-working, well-organized engineers to work on a variety of airport and roadway projects. These full-time positions will be located either in APTech’s corporate office in Champaign, Illinois, or our Waunakee, WI (Madison area) office. These will require occasional multi-day travel. The successful applicant will work on a variety of projects across the United States involving the evaluation, design, and management of pavement systems. Additional opportunities on projects involving pavement research and training are also available. Responsibilities The successful applicant will have a BS or MS in Civil Engineering or Transportation Planning. Interest in pavement management, evaluation, and design. Interest in asset management or performance-based planning, with preference given to candidates with previous data modeling experience. Proficiency with Microsoft Office programs (such as Word, Excel, PowerPoint and Access), experience with Structured Query Language (SQL), and good overall computer hardware and software skills. Excellent written and oral communication skills. Flexibility to travel, work weekends, and overtime as necessary. Familiarity with Pavement Condition Inspection (PCI) surveys, pavement condition assessments, and experience with PAVER or other pavement related software is preferred but not required. Experience with Geographic Information Systems (GIS) is a plus. Requirements Preference will be given : Advanced degree in civil engineering, with a concentration in transportation materials. Knowledge of pavement materials and pavement design and construction practices. Compensation Starting salary $64,000-$68,000 based on location. To apply, please use this link: https://go.illinois.edu/EngineerAssociateAppliedPavementTechnology",
    "discovered_date": "2025-11-05T15:46:37.828918"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47371",
    "company": "APTech",
    "position": "Equipment Operator / Engineering Technician – Applied Pavement Technology",
    "link": "https://researchpark.illinois.edu/job/equipment-operator-engineering-technician-applied-pavement-technology/",
    "posted_date": "Mon, 03 Nov 2025 20:47:40 +0000",
    "published_parsed": [
      2025,
      11,
      3,
      20,
      47,
      40,
      0,
      307,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2025/01/APT-2-150x150.jpg",
    "description": "About Applied Pavement Technology APTech is a full-service pavement engineering and transportation asset management consulting firm that provides effective solutions for the management of roadway and airport infrastructure. Since their founding in 1994, they have worked with clients at the state, federal, and local levels in the United States and abroad, and are a recognized leader in their industry. APTech helps clients identify cost-effective strategies that reduce the overall life-cycle cost of preserving their transportation networks while incorporating the latest management strategies and technologies into organizational practice. Please see the APTech Tenant Directory for more information. Applied Pavement Technology – Research Park About the Role Applied Pavement Technology, Inc (APTech) is seeking an Equipment Operator / Engineering Technician to join our team of skilled technicians who are responsible for collecting roadway and airport pavement-related data with our specialized pavement testing equipment and vehicles. An ideal candidate will have these characteristics: Interest in roads and/or aviation—Do you have an interest in aviation? Have you ever wondered what it would be like to be on a runway at a major airport? Our technicians get the opportunity to collect data at a wide range of roadway and aviation facility types. Enjoy travel—Our technicians get the opportunity to work on roadways, airports, military bases, national forests, and so on in various locations throughout the United States and Canada. Note, when traveling, each APTech employee has their own hotel room, receives paid travel expenses, and receives a daily per diem allowance for meals. Mechanically inclined—Are you mechanically inclined? The ideal person for this position will be well-organized, enjoy getting their hands dirty, have some experience turning a wrench, and be able to troubleshoot issues and problem solve in the field when needed. Responsibilites Primary responsibilities associated with this position include: Operating of specialized testing equipment on roadways and airports to collect pavement-related condition data. Testing equipment is mounted to a van or pulled behind a pickup truck. Maintaining and troubleshooting of the equipment. Mobilizing the equipment to and from the job site. Providing additional engineering project support when in the office (e.g., GIS and CAD mapping, pavement condition workstation surveys, and so on). Occasionally conducting manual pavement inspections. APTech will provide paid training and develop successful applicants on the operation and use of the following specialized testing equipment: Automated distress data collection vehicle. Falling weight deflectometer. Requirements Primary requirements associated with this position include: This position will require multi-day travel and may require occasional night work. Typical trips last 5-12 days with the goal of not exceeding 14 days/month. Flexibility to work overtime and weekends when necessary. Valid driver’s license. Experience pulling trailers. Ability to drive for 8-12 hours within a day. Lift and move 60 lbs. Mechanically inclined with good troubleshooting and problem-solving skills. Knowledge of electrical, mechanical and hydraulic systems is a plus. Outgoing personality. Good communication, organizational, and time-management skills. Good punctuality, trustworthiness, and professionalism when working independently. Good overall computer usage skills, including familiarity with the Microsoft Office software suite (Word, Excel, Outlook). Experience with AutoCAD and ArcGIS is a plus. Aviation experience and/or former military is a plus. Compensation Annual Salary: $24.00-$32.00 per hour based on experience To apply, please use this link: https://go.illinois.edu/EquipmentOperatorEngineeringTechnichianAppliedPavementTechnology",
    "discovered_date": "2025-11-05T15:46:37.828927"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47369",
    "company": "APTech",
    "position": "Intern – Applied Pavement Technology",
    "link": "https://researchpark.illinois.edu/job/intern-applied-pavement-technology/",
    "posted_date": "Mon, 03 Nov 2025 20:32:26 +0000",
    "published_parsed": [
      2025,
      11,
      3,
      20,
      32,
      26,
      0,
      307,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2025/01/APT-2-150x150.jpg",
    "description": "About Applied Pavement Technology APTech is a full-service pavement engineering and transportation asset management consulting firm that provides effective solutions for the management of roadway and airport infrastructure. Since their founding in 1994, they have worked with clients at the state, federal, and local levels in the United States and abroad, and are a recognized leader in their industry. APTech helps clients identify cost-effective strategies that reduce the overall life-cycle cost of preserving their transportation networks while incorporating the latest management strategies and technologies into organizational practice. Please see the APTech Tenant Directory for more information. Applied Pavement Technology – Research Park About the Role APTech has up to four (4) immediate openings for hard-working, well-organized Engineering Interns to work on a variety of airport and roadway projects. These temporary positions will be located either in APTech’s corporate office in Champaign, Illinois, or our Waunakee, WI (Madison area) office. These will require occasional multi-day travel. Engineering Interns support Civil engineers in facilitating field data collection activities, conducting pavement testing assessments, and supporting other project related work across the United States. Responsibilities Engineering Interns are responsible for: Conducting pavement inspections. Creating and updating two-dimensional mappings. Managing database developments and indexing. Proficiency with Microsoft Office programs (such as Word, Excel, PowerPoint and Access), experience with Structured Query Language (SQL), and good overall computer hardware and software skills. Excellent written and oral communication skills. Flexibility to travel, work weekends, and overtime as necessary. Experience with Geographic Information Systems (GIS) is a plus. Requirements Course work or a degree in civil engineering, with a concentration in transportation materials. Knowledge of pavement materials and pavement design and construction practices. GIS and AutoCAD experience Compensation $21.00-$23.00 per hour. Engineering Interns will receive paid travel expenses and per diem allowance for meals. To apply, please use this link: https://go.illinois.edu/InternAppliedPavementTechnology",
    "discovered_date": "2025-11-05T15:46:37.828929"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47368",
    "company": "APTech",
    "position": "Marketing Coordinator – Applied Pavement Technology",
    "link": "https://researchpark.illinois.edu/job/marketing-coordinator-applied-pavement-technology/",
    "posted_date": "Mon, 03 Nov 2025 20:15:36 +0000",
    "published_parsed": [
      2025,
      11,
      3,
      20,
      15,
      36,
      0,
      307,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2025/01/APT-2-150x150.jpg",
    "description": "About Applied Pavement Technology APTech is a full-service pavement engineering and transportation asset management consulting firm that provides effective solutions for the management of roadway and airport infrastructure. Since their founding in 1994, they have worked with clients at the state, federal, and local levels in the United States and abroad, and are a recognized leader in their industry. APTech helps clients identify cost-effective strategies that reduce the overall life-cycle cost of preserving their transportation networks while incorporating the latest management strategies and technologies into organizational practice. Please see the APTech Tenant Directory for more information. Applied Pavement Technology – Research Park About the Role Applied Pavement Technology, Inc. is seeking a full-time Marketing Coordinator to join our team. This position is based in APTech’s corporate headquarters in Champaign, Illinois, with the potential for a hybrid in-office/work from home schedule. Responsibilities The ideal candidate will possess strong writing and critical thinking abilities, attention to detail, and good organizational skills. The primary duties of this position include: Composing, updating, and maintaining corporate resumes on an annual basis. Working with project managers and technical staff to develop highly engaging and effective project summaries, as well as managing processes for maintenance and upkeep. Completing prequalification applications at their annual or multi-year renewal deadlines in coordination with the Marketing Manager and technical program leads. Participating in regularly scheduled content calendar development meetings for corporate-owned media. Coordinating with subject matter experts and other marketing staff to create and publish strategic, relevant, and resonant content. Assisting with maintenance of existing marketing data records, as well as data analysis and tracking. Assisting the Marketing Manager with procurement research, including searching government agency and aggregator websites and identifying relevant leads for business development. Requirements Bachelor’s degree in marketing, communications, English, or related field. At least 2 years of relevant experience are preferred. Knowledge of and experience with Microsoft Office software products (Word, PowerPoint, and Excel). Strong organizational, time management, and communication skills. Ability to perform in both self-guided and structured work environments Compensation APTech offers highly competitive compensation and benefits packages aimed at meeting the needs of employees and their families. Compensation for this position is negotiable and competitive based on level of experience and qualifications. The salary range for this position is expected to be between $52,000 and $57,000 annually. To apply, please use this link: https://go.illinois.edu/MarketingCoordinatorAppliedPavementTechnology",
    "discovered_date": "2025-11-05T15:46:37.828930"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47260",
    "company": "John Deere",
    "position": "Part-Time Student – John Deere",
    "link": "https://researchpark.illinois.edu/job/part-time-student-uiuc-john-deere/",
    "posted_date": "Tue, 28 Oct 2025 18:58:21 +0000",
    "published_parsed": [
      2025,
      10,
      28,
      18,
      58,
      21,
      1,
      301,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2022/07/SquareLogo-John-Deere-150x150.png",
    "description": "About John Deere John Deere, an American corporation, manufactures agricultural, forestry, and lawn care equipment, along with heavy equipment and diesel engines. Founded in 1868 by John Deere and partners, the company, headquartered in Moline, Illinois, is listed on the New York Stock Exchange under the symbol DE. Known for its steel plow invention and leaping deer logo, John Deere operates over 100 factories globally and is a leader in agricultural equipment, including tractors and combines. There are over 7 billion people on this planet. And by 2050, there will be 2 billion more&#8230; many moving into urban centers at an unprecedented rate. Making sure there is enough food, fiber and infrastructure for our rapidly growing world is what we&#8217;re all about at John Deere. And it&#8217;s why we&#8217;re investing in our people and our technology like never before! Here the world&#8217;s brightest minds are tackling the world&#8217;s biggest challenges. If you believe one person can make the world a better place, we&#8217;ll put you to work. About the Role As an UIUC Part Time Student for Deere &#38; Company World Headquarters located in Champaign, IL, it is a project based part time student team. We look to match this team&#8217;s interests with the organizations project needs across different computer science related fields. For this first project you will be working with a team working on data pipelines on a data streaming project. Additionally you will: Collaborate with senior developers and other students to build full-stack applications Pitch, design, and build new features for internal software products Skills Needed  Strong problem-solving skills  Ability to communicate with technical and non-technical team members Ability to learn quickly 1 or more years’ experience with a programming language Ideally you will be pursuing a Computer Science / Computer Engineering, or related quantitative discipline; others may apply Must be registered as a full-time student at an accredited university/college Graduation date of December 2026 or later Cumulative GPA of 2.8 or above Available to work 10 hours per week in the office Available to work 10-20 hours/weekly during the academic year Available to work 40 hours/weekly during the summer semester What makes you standout This project: Experience building data pipelines Experience with Java Spring Boot APIs Experience with infrastructure as code for AWS Experience with Data Bricks In general for other projects: Experience building full-stack web applications Experience with React Experience with SQL, databases, and schema design Experience in Agile development At John Deere, you are empowered to create a career that will take you to where you want to go while working in an inclusive team environment. Here, you&#8217;ll enjoy the freedom to explore new projects, the support to think outside the box and the advanced tools and technology that foster innovation and achievement. Additionally, we offer a comprehensive reward package to help you get started on your new career path, including: Flexible work arrangements Highly competitive base pay and performance bonuses Savings &#38; Retirement benefits (401K and Defined Benefit Pension) Healthcare benefits with a generous company contribution in the Health Savings Account Adoption assistance Employee Assistance Programs Tuition assistance Fitness subsidies and on-site gyms at specific Deere locations Charitable contribution match Employee Purchase Plan &#38; numerous discount programs for personal use $15 &#8211; $40 hourly based on published rates for business function and education level. To apply, please use this link: https://go.illinois.edu/JohnDeerePartTimeStudentUIUC",
    "discovered_date": "2025-11-05T15:46:37.828931"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47232",
    "company": "APTech",
    "position": "Senior Engineering (Transportation Asset Management) – Applied Pavement Technology",
    "link": "https://researchpark.illinois.edu/job/senior-engineering-transportation-asset-management-applied-pavement-technology/",
    "posted_date": "Thu, 23 Oct 2025 20:26:09 +0000",
    "published_parsed": [
      2025,
      10,
      23,
      20,
      26,
      9,
      3,
      296,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2021/08/APTech-150x150.png",
    "description": "About Applied Pavement Technology We are a full-service pavement engineering consulting firm that provides effective solutions for the design, evaluation, maintenance, and rehabilitation of roadway and airport pavements. Since our founding in 1994, we have worked with clients at the state, federal, and local levels in the United States and abroad, and we are a recognized leader in our industry. We help our clients identify cost-effective strategies that reduce the overall life-cycle cost of preserving the pavement network while incorporating the latest pavement-related designs and technologies into organizational practice. Please see the APTech Tenant Directory for more information. Applied Pavement Technology &#8211; Research Park About the Role APTech has an immediate opening for an experienced Transportation Asset Management Professional to work on a variety of projects for local, state, and federal clients. This position will report to APTech’s corporate office in Champaign, Illinois with potential for a hybrid or work from home schedule based on the candidate’s location and experience. This position will require occasional multi-day travel. The ideal candidate demonstrates a strong attention to detail with experience involving transportation asset management with excellent written and oral communication skills. Responsibilities The primary responsibilities will be on a variety of projects across the United States involving research, planning, analysis, and training development in the areas of highway infrastructure asset management, transportation performance management, and highway maintenance management. Projects will involve the full spectrum of highway infrastructure including pavement, bridge, hydraulics, ancillary structures, safety, and roadside assets. Familiarity with state asset management plans, asset condition assessment, performance modeling, and asset and/or maintenance management related software is a plus. Experience with Geographic Information Systems (GIS) is a plus. Job Requirements BS or MS in Civil Engineering, Transportation Planning or similar relevant degree. 8+ years of relevant experience. Professional Engineering License. Excellent written and oral communication skills. Experience in transportation asset management, transportation performance management, or highway maintenance management. Flexibility to travel, and ability to work occasional weekends and overtime as necessary. Preferences Experience working for an infrastructure-owner agency. Experience with State transportation asset management plans. Experience developing or delivering training. Active participation in national organizations such as the American Association of State Highway and Transportation Officials or the Transportation Research Board. Institute of Asset Management (IAM) Certification. Benefits APTech offers highly competitive compensation and benefits packages aimed to meet the needs of all employees and their families. To apply, please use this link: https://go.researchpark.illinois.edu/SeniorEngineering(TransportationAssetManagement)-APTECH and select &#8220;Asset Management Engineer.&#8221;",
    "discovered_date": "2025-11-05T15:46:37.828932"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47207",
    "company": "Boston Bioprocess",
    "position": "Spring/Summer Software Engineering Intern-Boston Bioprocess",
    "link": "https://researchpark.illinois.edu/job/spring-summer-software-engineering-intern-boston-bioprocess/",
    "posted_date": "Wed, 22 Oct 2025 21:08:48 +0000",
    "published_parsed": [
      2025,
      10,
      22,
      21,
      8,
      48,
      2,
      295,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2025/03/boston-bioprocess-logo-e1741364276860-150x150.png",
    "description": "About Boston Bioprocess Boston Bioprocess, Inc.’s mission is to help fermentation product companies develop and scale up production. We specialize in providing innovative solutions and services to support the research, development, and manufacturing processes of our clients. Please see Boston Bioprocess Tenant Directory for more information. Boston Bioprocess &#8211; Carver Biotech About the role We are looking for a full-time software engineering intern for Spring of 2026 to work and contribute to our growing software stack. This role will be working in the data science team, while closely interacting with fermentation scientists and process development engineers to develop cloud-based apps/ETL pipelines and dashboards to manage fermentation data. Qualifications Final-year undergraduate or master&#8217;s student in Computer Science or related field. Technical Skills: Experience in full-stack development with Node.js, FastAPI, React, TailwindCSS, Plotly.js. Proficiency in databases: PostgreSQL, SQL, NoSQL. Familiarity with Alembic for database migrations. Strong API development and API testing skills. Ability to debug code efficiently. Experience in dashboard creation and data visualization. Familiarity with version control tools like Git. UI/UX &#38; Product Ownership: A good eye for UI/UX design and detail-oriented approach. Ability to take ownership of features and drive improvements. AI &#38; Efficiency: Ability to leverage AI tools to write minimal, efficient code. Understanding of AI-generated code and capability to debug/fix issues when required. Work Ethic &#38; Growth Mindset: Eager to learn and grow in a fast-paced startup environment. Good academic standing with a strong problem-solving mindset. Excellent problem-solving skills and attention to detail. Strong communication and teamwork abilities. The pay range for this role is: 20 &#8211; 25 USD per hour. To apply, please use this link: https://go.researchpark.illinois.edu/SpringtoSummerSoftwareEngineeringIntern-BostonBioprocess",
    "discovered_date": "2025-11-05T15:46:37.828933"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47169",
    "company": "Yahoo!",
    "position": "Software Dev Engineer I – Yahoo!",
    "link": "https://researchpark.illinois.edu/job/software-dev-engineer-i/",
    "posted_date": "Thu, 16 Oct 2025 23:53:02 +0000",
    "published_parsed": [
      2025,
      10,
      16,
      23,
      53,
      2,
      3,
      289,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2022/07/SquareLogo-Yahoo-150x150.png",
    "description": "About Yahoo! Yahoo is an American web portal that provides the search engine Yahoo Search and related services including My Yahoo, Yahoo Mail, Yahoo News, Yahoo Finance, Yahoo Sports, y!entertainment, yahoo!life, and its advertising platform, Yahoo Native. Yahoo builds, improves, and maintains one of the highest scaling platforms in the world. Their amazing team of engineers work on next-generation big data platforms that transform how users connect every single day. Yahoo&#8217;s Big Data Platform drives some of the most demanding applications in the industry. The system handles billions of requests a day and runs on some of the largest Hadoop clusters ever built! 50,000 nodes strong and several multi-thousand node clusters bring scalable computing to a whole new level. They work on problems that cover a wide spectrum &#8211; from web services to operating systems and networking layers. Their biggest challenges ahead are designing efficient cloud-native big data platforms. About the Role You will be part of the Big Data Solutions engineering team, contributing to the design and implementation of robust Big Data solutions on AWS, GCP, and Databricks platforms. You will be involved in the design, implementation, and testing of end-to-end solutions, ensuring sound development  practices are followed to achieve well-tested technical solutions, ideally in a Unix environment. You will gain experience with containerization (ideally Kubernetes) and Big Data technologies, challenging security constraints, and myriad AWS/GCP services, with Python and Java as primary development languages. Responsibilities A solid working understanding of cloud technologies is a must. Knowledge of developing clean APIs and integrating with existing web services is  required, as well as a solid understanding of core architectural principles and a cloud-native solutions mindset. You will contribute to projects involving distributed systems, cloud technologies, Agentic AI workflows, and ML use cases. Experience with Spark, Airflow, Vertex AI, and Sagemaker  is a plus. You will be highly motivated and able to work independently or as part of a cross-functional team on complex projects. Big Data platform: implementing and scaling solutions using Big Data technologies like Hadoop, Spark, Airflow, ensuring high performance and scalability. Data Orchestration: Utilizing tools like Airflow to manage the scheduling, execution, andmonitoring of data workflows across cloud platforms such as AWS and GCP. Integration and Support: Collaborating with different teams to integrate data processing, MLOps and AIOps. Feature Development: Implementing new features to support advanced processing capabilities, including cost and performance optimization. Must be self-motivated, proactive, driven and able to execute tasks both independently and within a team environment. Ability to comprehend and communicate in a complex technical environment. Understand and apply common design and architectural patterns. Share knowledge and experience through thorough code review processes. Display a history of creativity, innovative thought, awareness of current technical trends and high levels of motivation. Required skills 3+ years of experience in software development. Programming skills: Python/Java/Golang. Excellent knowledge of Spark, Airflow, Terraform, AWS/GCP and cloud native services like EMR, Sagemaker, Dataproc, Bigquery, VertexAI, Airflow. Familiarity with Kubernetes, Docker, and Containerization. Operating systems: Mac/Linux. Bachelor&#8217;s degree in Computer Science, Software Engineering or a related field or relevant experience. To apply, please send your resume to resume-champaign-data@yahooinc.com.",
    "discovered_date": "2025-11-05T15:46:37.828934"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47166",
    "company": "Yahoo!",
    "position": "DevOps Engineer – Yahoo!",
    "link": "https://researchpark.illinois.edu/job/devops-engineer/",
    "posted_date": "Thu, 16 Oct 2025 23:09:46 +0000",
    "published_parsed": [
      2025,
      10,
      16,
      23,
      9,
      46,
      3,
      289,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2022/07/SquareLogo-Yahoo-150x150.png",
    "description": "About Yahoo! Yahoo is an American web portal that provides the search engine Yahoo Search and related services including My Yahoo, Yahoo Mail, Yahoo News, Yahoo Finance, Yahoo Sports, y!entertainment, yahoo!life, and its advertising platform, Yahoo Native. The Central Data Platform team builds industry leading next generation cloud platforms, services and tools that underpin our products. They build and maintain systems at scale and ensure that Yahoo is always able to process petabytes of data and billions of events daily. Using a combination of open source software and internal tools across multiple cloud providers, they engineer platform solutions for data collection, stream processing, batch-processing, data querying, data governance, and data lineage. Yahoo! promotes and enables developer self-sufficiency and DevOps ownership models. About the Role We&#8217;re looking for world-class, fun-loving engineers to join our team in Champaign, Illinois, where you will have the opportunity to help develop scalable, high-speed data solutions for data collection and low-latency platforms. You will analyze requirements; investigate optimal software solutions; architect, design, implement and test those solutions; and support our globally deployed data collection and low-latency platforms in production environment. Responsibilities Working through documents and conversations with colleagues to understand product requirements for new features. Shaping those requirements into design documents and software implementation. Testing and debugging both your own software and some written by others. Analyzing and refactoring existing software to enhance its reliability, performance, supportability, and operability. Work closely with cross-functional teams to understand product and technical roadmaps, identifying potential impacts on system operability and proposing proactive solutions for Cloud environments. Lead initiatives to enhance and optimize existing cloud infrastructure, drive improvements in scalability, efficiency, and resilience, and oversee large-scale projects related to cloud platforms, automation, and performance optimization. Foster cross-functional collaboration between development, infrastructure, and operations teams to improve the overall performance and reliability of services on cloud. Requirements A solid Computer Science foundation in data structures and algorithms, object oriented programming, and modern software engineering practices from your achievement of obtaining a degree in CS or a similar engineering pursuit.  The ability to use an object oriented programming language like Java or C++ or scripting languages like Python or Perl, and Unix or Linux systems. Excellent design, coding, debugging and testing skills. Facility with data concepts such as joins, aggregation, projection, and explosion. The ability to work with large-scale distributed systems. Solid written and verbal communication skills. Excellent problem solving and organizational skills. Great team-working capabilities in an agile development environment. Willingness to engage productively with others in the industry. The passion to build great products, work with great people and change the world. Preferred Qualifications Experience in designing, managing large scale infrastructure in either AWS EKS, AWS Open Search, or GCP GKE, GCP Observability/Monitoring and with multi zone, multi region deployments. Experience working with IaC (eg. Terraform, Ansible). Familiarity &#38; working experience with Kubernetes and container-based orchestration. To apply, please send resumes to resume-champaign-data@yahooinc.com.",
    "discovered_date": "2025-11-05T15:46:37.828935"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47048",
    "company": "RationalCyPhy Inc",
    "position": "Robotics Hardware Engineer – Rational CyPhy Inc",
    "link": "https://researchpark.illinois.edu/job/robotics-hardware-engineer/",
    "posted_date": "Thu, 02 Oct 2025 20:01:14 +0000",
    "published_parsed": [
      2025,
      10,
      2,
      20,
      1,
      14,
      3,
      275,
      0
    ],
    "logo_url": null,
    "description": "About Rational CyPhy Inc. Rational CyPhy Inc. is a research-driven startup developing next-generation autonomous systems for critical applications such as wildfire suppression and disaster response. With support from NASA and AFRL, our team is building field-deployable aerial platforms that integrate machine learning, perception, and robust autonomy. About the Role We are looking for a Robotics Hardware Engineer with strong hands-on experience in prototyping and field testing robotic systems. Ideal candidates will have worked on aerial robots (quad rotors or fixed-wings), aerospace, or autonomous vehicle platforms. You will join a small, collaborative team advancing the state of the art in real-world autonomy. Responsibilities Lead all aspects of the development of an autonomous aerial vehicle prototype, including assembling, maintenance, redesign Integrate embedded hardware: sensors, flight computer, camera, visual odometry, radios, and mechanical components Conduct bench testing, debugging, and validation of integrated subsystems Conduct field testing and iterative hardware-software integration and data collection Collaborate with AI researchers and software engineers to ensure system-level functionality and reliability Minimum Requirements Bachelor’s or Master’s degree in Electrical Engineering, Mechanical Engineering, Mechatronics, Robotics, or a related field At least 2–4 years of industry, research, or advanced academic experience involving hardware development and integration Proficiency in one or more of the following: CAD tools (e.g., SolidWorks, Fusion 360), embedded systems (e.g., Ardupilot, PX4, Betaflight) Experience assembling and debugging sensor-actuator systems, embedded , or robotics subsystems or flight controllers, ROS Strong lab skills, e.g., soldering, wiring, debugging, power distribution, instrumentation Online portfolio of hardware or software projects Excellent communication and documentation skills US Citizenship Nice to have Experience flying and building quadrotors Field test experience in challenging environments (e.g., outdoors, hazardous conditions) FAA Part 107 certification or interest in UAV operations Prior work on federally funded R&#38;D efforts (e.g., SBIR/STTR, DoD, NASA) Why Join RationalCyPhy Inc. Tackle real-world autonomy challenges with high-impact applications Collaborate with a small, mission-focused team at the intersection of AI, robotics, and aerospace Access to state-of-the-art research and test facilities at UIUC and regional partners Competitive compensation, flexible hours, and opportunities for technical leadership Build systems that go beyond the lab — into fire zones, forests, and disaster sites Job Type: Full-time Pay: $90,432.00 &#8211; $120,000.00 per year Benefits: Health insurance Application Question(s): Are you a citizen of the United States? Ability to Relocate: Champaign, IL 61820: Relocate before starting work (Preferred) Work Location: In person To apply, please send resume and cover letter to ckzeitler@gmail.com.",
    "discovered_date": "2025-11-05T15:46:37.828936"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47041",
    "company": "Aviatrix",
    "position": "MTS (Software Development) – Aviatrix",
    "link": "https://researchpark.illinois.edu/job/mts-software-development/",
    "posted_date": "Wed, 01 Oct 2025 20:57:37 +0000",
    "published_parsed": [
      2025,
      10,
      1,
      20,
      57,
      37,
      2,
      274,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2020/05/aviatrix-150x150.png",
    "description": "About Aviatrix For enterprises struggling to secure cloud workloads, Aviatrix® offers a single solution for pervasive cloud security. Where current cybersecurity approaches focus on securing entry points to a trusted space, Aviatrix Cloud Native Security Fabric (CNSF) delivers runtime security and enforcement within the cloud application infrastructure itself – closing gaps between existing solutions and helping organizations regain visibility and control. Aviatrix ensures security, cloud, and networking teams are empowering developer velocity, AI, serverless, and what’s next. Aviatrix’s mission is to simplify cloud networking so companies stay agile. The pioneer of secure cloud networking delivers advanced cloud networking, network security, and operational visibility required by enterprises with cloud-native simplicity and automation. Over 500 customers worldwide leverage Aviatrix and its proven multi-cloud network reference architecture to design, deploy, and operate a repeatable network and security architecture consistent across any public cloud. Combined with the industry’s first and only multi-cloud networking certification program (ACE), Aviatrix is empowering IT to lead and accelerate the transformation to the cloud. About the Role The Aviatrix Distributed Cloud Firewall (DCF) Engineering team is responsible for delivering performant, resilient, and scalable firewall solutions to our gateway appliances. The DCF infrastructure spans the Aviatrix multi-cloud solution and includes policy structures dynamically applied to changing enforcement locations, infrastructure for messaging, upgrade, high availability, as well as security features that contribute to the Aviatrix, end to end multi-cloud solution. We are searching for a Member of Technical Staff (MTS) to join the DCF team working on data plane software. You will contribute to development projects under the guidance of senior engineers to solve new challenges in multi-cloud networks and connecting cloud to the edge with security. You will implement features, fix bugs, and help improve the efficiency, scalability and stability of DCF components, gaining valuable experience in multi-cloud networking and security services. This position offers flexibility to work hybrid in Champaign, IL. Responsibilities Implement and test features and improvements to the DCF data plane in C/C++. Contribute to the development of data plane filtering logic in C/C ++. Contribute to incremental improvements that strengthen customer security posture. Collaborate with team members to deliver features end-to-end. Participate in design discussions, design reviews and code reviews to build technical expertise. Debug and fix issues to improve efficiency, scalability, and stability of DCF components. Actively participate in team meetings and cross-functional discussions. Qualifications 0-3 years of relevant software development experience. Bachelor’s Degree in Engineering, Computer Science or a related field. Strong software engineering fundamentals: ability to write clean, testable, and maintainable code. Coursework, personal projects or corporate experience in systems development such as networking systems, operating systems, security, or distributed systems. Proficiency in C, C++, Rust or similar language. Strong collaboration skills; able to work well in team-oriented and fast-paced environments. Effective communication skills, verbal and written. Nice to have Knowledge of Networking Protocols (TCP, UDP, TLS, DNS, DHCPv6). Security protocol experience (SSL, authentication and authorization, firewall). Prior working experience on one or more Cloud Service Providers (AWS, Azure, GCP, OCI, Alibaba cloud, etc.). Experience with overlays and tunneling technologies. To apply, please use this link: https://go.illinois.edu/MTSSoftwareDevelopment",
    "discovered_date": "2025-11-05T15:47:32.599114"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47040",
    "company": "Aviatrix",
    "position": "Staff Engineer (Software Development) – Aviatrix",
    "link": "https://researchpark.illinois.edu/job/staff-engineer-software-development/",
    "posted_date": "Wed, 01 Oct 2025 20:25:10 +0000",
    "published_parsed": [
      2025,
      10,
      1,
      20,
      25,
      10,
      2,
      274,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2020/05/aviatrix-150x150.png",
    "description": "About Aviatrix Aviatrix presents a modern security network solution for cloud and Kubernetes environments. It focuses on safeguarding network security, boosting performance, minimizing expenses, and establishing secure hybrid cloud connections. For enterprises struggling to secure cloud workloads, Aviatrix® offers a single solution for pervasive cloud security. Where current cybersecurity approaches focus on securing entry points to a trusted space, Aviatrix Cloud Native Security Fabric (CNSF) delivers runtime security and enforcement within the cloud application infrastructure itself – closing gaps between existing solutions and helping organizations regain visibility and control. Aviatrix ensures security, cloud, and networking teams are empowering developer velocity, AI, serverless, and what’s next. For more information, visit www.aviatrix.ai. About the Role The Aviatrix Distributed Cloud Firewall (DCF) Engineering team is responsible for delivering performant, resilient, and scalable firewall solutions to our gateway appliances. The DCF infrastructure spans the Aviatrix multi-cloud solution and includes policy structures dynamically applied to changing enforcement locations, infrastructure for messaging, upgrade, high availability, as well as security features that contribute to the Aviatrix end to end multi-cloud solution. We are searching for a Staff Engineer to join the DCF team working on data plane software. In this role, you will independently own and deliver significant components of the data plane, designing and developing solutions that improve security and reliability for enterprise customers. You will evaluate tradeoffs, write and present design proposals, and collaborate closely with cross-functional teams. You will also provide guidance and mentorship for junior members of the team. You will implement features, fix bugs, and help improve the efficiency, scalability and stability of DCF components. This position offers flexibility to work hybrid in Champaign, IL. Responsibilities Own the design, development, and reliability of significant data plane components, ensuring scalability, security, and performance. Implement and test features and improvements to the DCF data plane in C/C++. Design and develop data plane filtering and security enforcement logic in C/C++. Write and present design proposals and documentations for moderately complex features. Contribute to improvements that strengthen customer security posture. Debug and fix issues to improve efficiency, scalability, and stability of DCF components. Use your technical expertise to improve code quality through code and design reviews. Collaborate with team members to deliver features end-to-end. Mentor junior engineers by providing technical guidance and feedback. Represent the DCF team as a technical contact in cross-functional discussions and external technical engagements as needed. Qualifications 6+ years of relevant software development experience. Bachelor’s Degree in Computer Engineering, Computer Science or a related field. Strong software engineering fundamentals: ability to write clean, testable, and maintainable code. Extensive experience with network programming. Experience developing on a Linux platform. Knowledge of Networking Protocols (TCP, UDP, TLS, DNS, DHCPv6). Expertise in C, C++, Rust or similar language. Strong collaboration skills; able to work well in team-oriented and fast-paced environments. Effective verbal and written communication skills. Nice to have Security protocol experience (SSL, authentication and authorization, firewall). Prior working experience on one or more Cloud Service Providers (AWS, Azure, GCP, OCI, Alibaba cloud, etc.). Familiarity with overlays and tunneling technologies. Experience with Linux kernel development. Python and golang experience. To apply, please use this link: https://go.illinois.edu/StaffEngineer-SoftwareDevelopment",
    "discovered_date": "2025-11-05T15:47:32.599126"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47015",
    "company": "Epivara",
    "position": "Formulation Scientist",
    "link": "https://researchpark.illinois.edu/job/formulation-scientist/",
    "posted_date": "Thu, 25 Sep 2025 22:04:25 +0000",
    "published_parsed": [
      2025,
      9,
      25,
      22,
      4,
      25,
      3,
      268,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2025/09/epivara-logo.avif",
    "description": "About Epivara Epivara is transforming animal welfare through science-driven innovation. Our mission is simple yet profound: how we treat animals matters. We are pioneering next-generation alternatives to traditional spay and neuter surgeries. By eliminating the need for invasive procedures, Epivara is creating a safer, more humane, and cost-effective approach to animal population control. Our work empowers veterinarians, shelters, and welfare organizations around the world to improve animal health, reduce overpopulation, and expand access to care—one injection at a time. About the Role Epivara is building a dedicated Formulation Team to accelerate the development of next generation drug delivery systems for humane sterilization of domestic animals and beyond. The Formulation Scientist will participate in developing formulation for drug delivery as a form of pellet, tablet, and implant. Reporting the Lead Chemist/Scientist and collaborating with the R&#38;D team, this individual will play a critical role in advancing Epivara’s core pipeline (iSpay and iNeuter across multiple species) while also driving new product innovations for animal and human medicine. The role is hands-on, requiring a bachelor’s degree-level scientist/engineer with strong theoretical background and laboratory experience. Pay Range $60,000 &#8211; 100,000 Responsibilities Formulation Design &#38; Development Work on formulation projects for controlled- and sustained-release drug delivery systems, including polymerbased implants, biodegradable pellets, and other forms. Explore and design additional prototypes for broader applications in veterinary and human medicine. Perform testing of stability, compatibility, release kinetics, and bioavailability in collaboration with internal and external partners. Laboratory &#38; Team Building Under the supervision of the Lead Chemist/Scientist, implement best practices for formulation design, recordkeeping, and regulatory compliance. Supervise and mentor junior chemists/scientists/engineers, fostering a culture of innovation, safety, and accountability. Collaborate with Epivara’s R&#38;D and operations teams to align project goals and timelines. Regulatory &#38; Commercial Support Generate formulation data packages to support regulatory submissions in domestic and international markets. Partner with regulatory experts to ensure formulations meet quality and compliance requirements. Provide technical input for manufacturing scale-up and technology transfer to CDMOs or industry partners. Strategic Contribution &#38; Growth Serve as Epivara’s in-house subject matter expert for drug delivery technologies. Contribute to the long-term pipeline strategy by identifying new opportunities and platforms. In the absence of the Lead Chemist/Scientist, represent Epivara in technical discussions with collaborators, investors, and strategic partners. Report regularly to the Lead Chemist/Scientist on formulation progress, challenges, and resource needs. Requirements Bachelor or higher degree in pharmaceutical sciences, chemistry, materials science, chemical engineering, or related field. Strong knowledge of basic chemistry, polymers, excipients, and controlled-release mechanisms. Skills in analytical characterization of formulations, including dissolution/release kinetics, stability testing, and physicochemical property evaluation. Experience working as a team member. Excellent communication and collaboration skills, with ability to work cross-functionally. Additional Preferences 2–5 years of practical, hands-on formulation lab experience. Familiarity with implant fabrication methods, including pellet pressing, extrusion, or injection molding. Team and Reporting Structure This position reports directly to the Lead Chemist/Scientist and will work with colleagues as a team member. The team is expected to expand as formulation programs progress toward commercialization. To apply, please send your resume/CV to hello@epivara.com including a personal description in the email body.",
    "discovered_date": "2025-11-05T15:47:32.599128"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=47005",
    "company": "Tiptek",
    "position": "Part-Time Production Technician",
    "link": "https://researchpark.illinois.edu/job/tiptek-savoy-illinois-5-part-time-production-technician/",
    "posted_date": "Wed, 24 Sep 2025 21:00:27 +0000",
    "published_parsed": [
      2025,
      9,
      24,
      21,
      0,
      27,
      2,
      267,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2024/09/TipTek-Logo-150x150.png",
    "description": "About Tiptek Tiptek, LLC’s product lines of probes and needles are used by industry leaders in semiconductor development and manufacturing for chip failure analysis. They are also used in the field of scanning probe microscopy and in applications that require electrical characterization and manipulation of objects on the nanometer scale. Tiptek was formed in May 2011. About the Role Tiptek is seeking a part-time Production Technician (PT) to support our team from October 2025 through January 2026. The PT will play a key role in the back-end production and quality assessment of small metal parts used in semiconductor failure analysis. The PT will work in a small, collaborative team environment and contribute to the production of high-quality products that support advanced semiconductor manufacturing and research. This position requires working effectively in a small team environment and performing standard operating procedures to strict quality standards.  The PT is responsible for safely operating production equipment and performing product quality-control assessments. This position requires good hand-eye coordination and dexterity for the safe handling of small parts. Qualifications and Skills Completed or currently pursuing A.S. or B.S. degree in materials science, engineering, physics, chemistry, or a related technical field. Ability to reliably commute to Savoy, IL (limited public transportation access). Experience working in a science or engineering laboratory preferred. Timeline and Schedule: Position Type: Temporary, part-time (October 2025 – January 2026). Work Hours: Up to 20 hours/week, with a minimum of 4-hour shifts. Responsibilities: Follow established methods, safety policies, standard operating procedures, and other provided instructions. Manage multi-step tasks with strong attention to detail. Maintain clean, organized, and hazard-free work areas. Perform general laboratory housekeeping and equipment maintenance. Monitor equipment performance by performing quality checks at specified intervals. Record daily production activities, maintain accurate logs, label materials, and track inventory in accordance with quality management standards. Contribute effectively in a small team environment. Support a high-throughput production environment. Perform other duties as assigned, including cross-training in additional production operations. To apply for this position, please email your resume to: info@tiptek.com",
    "discovered_date": "2025-11-05T15:47:32.599130"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=46941",
    "company": "APTech",
    "position": "Equipment Operator/ Engineering Technician",
    "link": "https://researchpark.illinois.edu/job/equipment-operator-engineering-technician-2/",
    "posted_date": "Fri, 19 Sep 2025 21:14:20 +0000",
    "published_parsed": [
      2025,
      9,
      19,
      21,
      14,
      20,
      4,
      262,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2021/08/APTech-150x150.png",
    "description": "About APTech We are a full-service pavement engineering consulting firm that provides effective solutions for the design, evaluation, maintenance, and rehabilitation of roadway and airport pavements. Since our founding in 1994, we have worked with clients at the state, federal, and local levels in the United States and abroad, and we are a recognized leader in our industry. We help our clients identify cost-effective strategies that reduce the overall life-cycle cost of preserving the pavement network while incorporating the latest pavement-related designs and technologies into organizational practice. About the Role Applied Pavement Technology, Inc (APTech) is seeking an Equipment Operator / Engineering Technician to join our team of skilled technicians who are responsible for collecting roadway and airport pavement-related data with our specialized pavement testing equipment and vehicles. An ideal candidate will have these characteristics: Interest in roads and/or aviation—Do you have an interest in aviation? Have you ever wondered what it would be like to be on a runway at a major airport? Our technicians get the opportunity to collect data at a wide range of roadway and aviation facility types. Enjoy travel—Our technicians get the opportunity to work on roadways, airports, military bases, national forests, and so on in various locations throughout the United States and Canada. Note, when traveling, each APTech employee has their own hotel room, receives paid travel expenses, and receives a daily per diem allowance for meals. Mechanically inclined—Are you mechanically inclined? The ideal person for this position will be well-organized, enjoy getting their hands dirty, have some experience turning a wrench, and be able to troubleshoot issues and problem solve in the field when needed. Responsibilities Operating of specialized testing equipment on roadways and airports to collect pavement-related condition data. Testing equipment is mounted to a van or pulled behind a pickup truck. Maintaining and troubleshooting of the equipment. Mobilizing the equipment to and from the job site. Providing additional engineering project support when in the office (e.g., GIS and CAD mapping, pavement condition workstation surveys, and so on). Occasionally conducting manual pavement inspections. APTech will provide paid training and develop successful applicants on the operation and use of the following specialized testing equipment: Automated distress data collection vehicle. Falling weight deflectometer. Job Requirements This position will require multi-day travel and may require occasional night work. Typical trips last 5-12 days with the goal of not exceeding 14 days/month. Flexibility to work overtime and weekends when necessary. Valid driver’s license. Experience pulling trailers. Ability to drive for 8-12 hours within a day. Lift and move 60 lbs. Mechanically inclined with good troubleshooting and problem-solving skills. Knowledge of electrical, mechanical and hydraulic systems is a plus. Outgoing personality. Good communication, organizational, and time-management skills. Good punctuality, trustworthiness, and professionalism when working independently. Good overall computer usage skills, including familiarity with the Microsoft Office software suite (Word, Excel, Outlook). Experience with AutoCAD and ArcGIS is a plus. Aviation experience and/or former military is a plus. To apply, visit http://appliedpavement.com/careers and select “Apply Here” and select “Equipment Operator / Engineering Technician.”",
    "discovered_date": "2025-11-05T15:47:32.599131"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=46926",
    "company": "Kocree",
    "position": "High-Performance Computing Developer",
    "link": "https://researchpark.illinois.edu/job/high-performance-computing-developer-2/",
    "posted_date": "Wed, 17 Sep 2025 20:11:39 +0000",
    "published_parsed": [
      2025,
      9,
      17,
      20,
      11,
      39,
      2,
      260,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2021/12/Kocree-Logo-150x114.png",
    "description": "About Kocree Kocree democratizes and decentralizes creativity through our proprietary AI and creativity chain, anchored in simplicity and transparency. This fusion powers a Web3 social game ecosystem: every creative process is immersive, fun, and personalized; every creative idea is owned, protected, and monetizable. Led by UIUC–Stanford–MIT founders, Kocree is home to the world’s leading artists and technologists in AI, blockchain, and HCI. We invite you to join us as an early core member, driving breakthrough creativity at the intersection of art, tech, business, and human wellbeing. About Kocree Music Kocree&#8217;s Muosaic project (“Music Mosaic”) elevates your daily music experience to a new level: from passive listening to composing music that is truly yours. Our creativity chain and AI give you the magic muons—music tokens that are the music vocabulary for everyone to speak, the “Lego bricks” that make music creation as playful as assembling Lego games, and digital assets that are traceable, attributable, and directly monetizable. With Muosaic, we bring music co-creation to everyone, and bring everyone together through music co-creation. About the Role (Internship and Full-Time) We seek passionate HPC developers with startup DNA, strong in the following areas: Develop HPC solutions for large-scale simulations, novel AI models, and data pipelines. Optimize system performance, resource utilization, and parallelism to ensure efficiency, scalability, and reliability. Collaborate with other developers to integrate HPC capabilities seamlessly into the broader system, enabling demanding workloads to run smoothly. Relevant skills (or their equivalents): Parallel Programming: C/C++, Python, MPI, OpenMP, CUDA, OpenCL Libraries: BLAS/LAPACK/ScaLAPACK, PETSc, cuDNN, NCCL, optimized NumPy/SciPy Cluster and storage: Slurm/PBS, Kubernetes (HPC integration), Lustre/GPFS  Hardware accelerators: many-core CPUs, GPUs, TPUs, FPGAs To apply, please use this application link: https://forms.gle/BSueEtTVs8nrpTk96 Contact Us Address: EnterpriseWorks 230F (60 Hazelwood Dr, Champaign, IL 61820) Email: kocree.inc@gmail.com",
    "discovered_date": "2025-11-05T15:47:32.599132"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=46923",
    "company": "Kocree",
    "position": "System Architect",
    "link": "https://researchpark.illinois.edu/job/system-architect-2/",
    "posted_date": "Wed, 17 Sep 2025 20:07:07 +0000",
    "published_parsed": [
      2025,
      9,
      17,
      20,
      7,
      7,
      2,
      260,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2021/12/Kocree-Logo-150x114.png",
    "description": "About Kocree Kocree democratizes and decentralizes creativity through our proprietary AI and creativity chain, anchored in simplicity and transparency. This fusion powers a Web3 social game ecosystem: every creative process is immersive, fun, and personalized; every creative idea is owned, protected, and monetizable. Led by UIUC–Stanford–MIT founders, Kocree is home to the world’s leading artists and technologists in AI, blockchain, and HCI. We invite you to join us as an early core member, driving breakthrough creativity at the intersection of art, tech, business, and human wellbeing. About Kocree Music Kocree&#8217;s Muosaic project (“Music Mosaic”) elevates your daily music experience to a new level: from passive listening to composing music that is truly yours. Our creativity chain and AI give you the magic muons—music tokens that are the music vocabulary for everyone to speak, the “Lego bricks” that make music creation as playful as assembling Lego games, and digital assets that are traceable, attributable, and directly monetizable. With Muosaic, we bring music co-creation to everyone, and bring everyone together through music co-creation. Job Description (Internship and Full-Time) We seek passionate system architects with startup DNA, strong in the following areas: Define the overall system architecture, ensuring all subsystems work seamlessly together. Build and maintain full-stack features across frontend, backend, and infrastructure. Lead system deployment and operations, delivering quality, reliability, and scalability. Relevant skills (or their equivalents): System design for scalable, reliable, and robust architectures API design, microservices, and distributed systems Cloud platforms and deployment pipelines (AWS/GCP/Azure, CI/CD) Containerization and orchestration (Docker, Kubernetes) Full-stack development: Python, Java, C++, JavaScript/TypeScript, React, Node.js Performance optimization, monitoring, and security best practices To apply, please use this application link: https://forms.gle/4E9LJxCi5fvP2Ddt5 Contact Us Address: EnterpriseWorks 230F (60 Hazelwood Dr, Champaign, IL 61820) Email: kocree.inc@gmail.com",
    "discovered_date": "2025-11-05T15:47:32.599134"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=46922",
    "company": "Kocree",
    "position": "Business Development",
    "link": "https://researchpark.illinois.edu/job/business-development-2/",
    "posted_date": "Wed, 17 Sep 2025 20:01:49 +0000",
    "published_parsed": [
      2025,
      9,
      17,
      20,
      1,
      49,
      2,
      260,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2021/12/Kocree-Logo-150x114.png",
    "description": "About Kocree Kocree democratizes and decentralizes creativity through our proprietary AI and creativity chain, anchored in simplicity and transparency. This fusion powers a Web3 social game ecosystem: every creative process is immersive, fun, and personalized; every creative idea is owned, protected, and monetizable. Led by UIUC–Stanford–MIT founders, Kocree is home to the world’s leading artists and technologists in AI, blockchain, and HCI. We invite you to join us as an early core member, driving breakthrough creativity at the intersection of art, tech, business, and human wellbeing. About Kocree Music Kocree&#8217;s Muosaic project (“Music Mosaic”) elevates your daily music experience to a new level: from passive listening to composing music that is truly yours. Our creativity chain and AI give you the magic muons—music tokens that are the music vocabulary for everyone to speak, the “Lego bricks” that make music creation as playful as assembling Lego games, and digital assets that are traceable, attributable, and directly monetizable. With Muosaic, we bring music co-creation to everyone, and bring everyone together through music co-creation. About the Role (Internship and Full-Time) We seek passionate BD specialists with startup DNA, strong in the following areas: Identify and develop business opportunities, plans, strategies, and partnerships. Plan, execute, and analyze GTM/marketing, user acquisition, and engagement initiatives. Craft compelling business pitches and communication materials. Create high-quality visual content: slides, posters, videos, and interactive prototypes, etc. Manage administrative and operational tasks, including product and team support. Relevant skills (or their equivalents): Marketing: Mailchimp, social media, event planning and organization Data analytics: survey, interviews, Google Analytics, CRM analytics, data visualization Presentation: docs, slides, flow charts, storytelling, Figma Design: Canva, Adobe Creative Suite, Final Cut Pro To apply, please use this application link: https://forms.gle/cyS9DjxZ8Z5MdKq2A Contact Us Address: EnterpriseWorks 230F (60 Hazelwood Dr, Champaign, IL 61820) Email: kocree.inc@gmail.com",
    "discovered_date": "2025-11-05T15:47:32.599135"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=46920",
    "company": "Kocree",
    "position": "Blockchain Developer",
    "link": "https://researchpark.illinois.edu/job/blockchain-developer-2/",
    "posted_date": "Wed, 17 Sep 2025 19:46:45 +0000",
    "published_parsed": [
      2025,
      9,
      17,
      19,
      46,
      45,
      2,
      260,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2021/12/Kocree-Logo-150x114.png",
    "description": "About Kocree Kocree democratizes and decentralizes creativity through our proprietary AI and creativity chain, anchored in simplicity and transparency. This fusion powers a Web3 social game ecosystem: every creative process is immersive, fun, and personalized; every creative idea is owned, protected, and monetizable. Led by UIUC–Stanford–MIT founders, Kocree is home to the world’s leading artists and technologists in AI, blockchain, and HCI. We invite you to join us as an early core member, driving breakthrough creativity at the intersection of art, tech, business, and human wellbeing. About Kocree Music Kocree&#8217;s Muosaic project (“Music Mosaic”) elevates your daily music experience to a new level: from passive listening to composing music that is truly yours. Our creativity chain and AI give you the magic muons—music tokens that are the music vocabulary for everyone to speak, the “Lego bricks” that make music creation as playful as assembling Lego games, and digital assets that are traceable, attributable, and directly monetizable. With Muosaic, we bring music co-creation to everyone, and bring everyone together through music co-creation. About the Role (Internship and Full-Time) We seek passionate blockchain developers with startup DNA, strong in the following areas: Design and build the full L1 blockchain system, including consensus, token systems, and proof-based mechanisms (PoW, PoS, PoUW/I), based on novel mathematical protocols. Develop smart contracts and distributed ledger solutions that meet high standards of security, reliability, and efficiency To apply, please use this application link: https://forms.gle/6D1Q6BrtUFYFX5wq7 Contact Us Address: EnterpriseWorks 230F (60 Hazelwood Dr, Champaign, IL 61820) Email: kocree.inc@gmail.com",
    "discovered_date": "2025-11-05T15:47:32.599136"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=46918",
    "company": "Kocree",
    "position": "AI Developer",
    "link": "https://researchpark.illinois.edu/job/ai-developer-2/",
    "posted_date": "Wed, 17 Sep 2025 19:37:21 +0000",
    "published_parsed": [
      2025,
      9,
      17,
      19,
      37,
      21,
      2,
      260,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2021/12/Kocree-Logo-150x114.png",
    "description": "About Kocree Kocree democratizes and decentralizes creativity through our proprietary AI and creativity chain, anchored in simplicity and transparency. This fusion powers a Web3 social game ecosystem: every creative process is immersive, fun, and personalized; every creative idea is owned, protected, and monetizable. Led by UIUC–Stanford–MIT founders, Kocree is home to the world’s leading artists and technologists in AI, blockchain, and HCI. We invite you to join us as an early core member, driving breakthrough creativity at the intersection of art, tech, business, and human wellbeing. About Kocree Music Kocree&#8217;s Muosaic project (“Music Mosaic”) elevates your daily music experience to a new level: from passive listening to composing music that is truly yours. Our creativity chain and AI give you the magic muons—music tokens that are the music vocabulary for everyone to speak, the “Lego bricks” that make music creation as playful as assembling Lego games, and digital assets that are traceable, attributable, and directly monetizable. With Muosaic, we bring music co-creation to everyone, and bring everyone together through music co-creation. About the Role (Internship and Full-Time) We seek passionate AI developers with startup DNA, strong in the following areas: Develop AI/ML models and algorithms for creative content generation, recommendation, and analysis, leveraging domain-specific techniques as needed (e.g., audio tech, music AI). Build human-AI interaction that enables collaborative, personalized, and engaging UI/UX. Relevant skills (or their equivalents): Fundamentals: linear algebra, calculus, discrete math, numerical analysis, computational complexity, probability and statistics, optimization, data structure, algorithms AI/ML basics: core principles, data and feature engineering, model tuning and testing Python basics: NumPy, SciPy, Pandas, Matplotlib Modeling: scikit-learn, PyTorch/TensorFlow/JAX Music: Notation Software, DAW, MIDI, MusicXML, Librosa, Music21, Magenta To apply, please use this application link: https://forms.gle/QkFSig5tpdBrm7RM9 How to contact Address: EnterpriseWorks 230F (60 Hazelwood Dr, Champaign, IL 61820) Email: kocree.inc@gmail.com",
    "discovered_date": "2025-11-05T15:47:32.599137"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=46865",
    "company": "Tiptek",
    "position": "Production Technician",
    "link": "https://researchpark.illinois.edu/job/production-technician/",
    "posted_date": "Fri, 05 Sep 2025 18:52:19 +0000",
    "published_parsed": [
      2025,
      9,
      5,
      18,
      52,
      19,
      4,
      248,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2024/09/TipTek-Logo-150x150.png",
    "description": "About Tiptek Tiptek, LLC’s product lines of probes and needles are used by industry leaders in semiconductor development and manufacturing for chip failure analysis. They are also used in the field of scanning probe microscopy and in applications that require electrical characterization and manipulation of objects on the nanometer scale. Tiptek was formed in May 2011. About the Role Tiptek is seeking a full-time Production Technician (PT) to join our growing team. The PT will play a key role in the back-end production and quality assessment of small metal parts used in semiconductor failure analysis. The PT will work in a small, collaborative team environment and contribute to the production of high-quality products that support advanced semiconductor manufacturing and research. This position requires working effectively in a small team environment and performing standard operating procedures to strict quality standards. The PT is responsible for safely operating production equipment, performing product quality-control assessments, and maintaining quality-control records. The PT will be trained to verify and characterize Tiptek products via scanning electron microscopy (SEM) and optical microscopy and will be cross trained in certain other company production operations. This position requires good hand-eye coordination and dexterity for the safe handling of small parts. Skills and Qualifications A.S. or B.S. degree in materials science, engineering, physics, chemistry or a related technical field. Experience working in a science or engineering laboratory preferred. Experience with SEM desired but not required. Responsibilities Follow established methods, safety policies, standard operating procedures, and other provided instructions. Manage multi-step tasks with strong attention to detail. Maintain clean, organized, and hazard-free work areas. Perform general laboratory housekeeping and equipment maintenance. Characterize and qualify products using optical and scanning electron microscopy. Monitor equipment performance by performing quality checks at specified intervals. Record daily production activities, maintain accurate logs, label materials, and track inventory in accordance with quality management standards. Contribute effectively in a small team environment. Support a high-throughput production environment. Perform other duties as assigned, including cross-training in additional production operations. To apply, please email your resume and cover letter to: info@tiptek.com",
    "discovered_date": "2025-11-05T15:47:32.599138"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=46864",
    "company": "Tiptek",
    "position": "Laboratory Technician",
    "link": "https://researchpark.illinois.edu/job/laboratory-technician/",
    "posted_date": "Fri, 05 Sep 2025 18:47:07 +0000",
    "published_parsed": [
      2025,
      9,
      5,
      18,
      47,
      7,
      4,
      248,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2024/09/TipTek-Logo-150x150.png",
    "description": "About Tiptek Tiptek, LLC’s product lines of probes and needles are used by industry leaders in semiconductor development and manufacturing for chip failure analysis. They are also used in the field of scanning probe microscopy and in applications that require electrical characterization and manipulation of objects on the nanometer scale. Tiptek was formed in May 2011. About the Role Tiptek is seeking a full-time Laboratory Technician (LT) to join our growing team. The LT will play a key role in the electrochemical production and quality assessment of small metal parts used in semiconductor failure analysis. The LT will work in a small, collaborative team environment and contribute to the production of high-quality products that support advanced semiconductor manufacturing and research. This position requires working effectively in a small team environment and performing standard operating procedures to strict quality standards. The PT is responsible for the safe handling of chemical etching solutions, performing product quality-control assessments, and tracking inventory. This position requires good hand-eye coordination and dexterity for the safe handling of small parts. The LT will be trained to verify and characterize Tiptek products via scanning electron microscopy (SEM) and will be cross trained in certain other company production operations. Skills and Qualifications A.S. or B.S. degree in chemistry, physics, materials science, engineering, or a related technical field. Experience working in a science or engineering laboratory preferred, especially familiarity with protocols for safe handling and disposal of chemicals. Experience with SEM desired but not required. Responsibilities Follow established methods, safety policies, standard operating procedures, and other provided instructions. Manage multi-step tasks with strong attention to detail. Maintain clean, organized, and hazard-free work areas. Prepare chemical solutions and handle reagents safely. Perform general laboratory housekeeping and equipment maintenance. Characterize and qualify products using optical and scanning electron microscopy. Monitor equipment performance by performing quality checks at specified intervals. Record daily production activities, maintain accurate logs, label materials, and track inventory in accordance with quality management standards. Contribute effectively in a small team environment. Support a high-throughput production environment. Perform other duties as assigned, including cross-training in additional production operations. To apply, please email your resume and cover letter to: info@tiptek.com",
    "discovered_date": "2025-11-05T15:47:32.599140"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=46842",
    "company": "Caterpillar",
    "position": "2026 Engineering Rotational Development Program – Product Development Track",
    "link": "https://researchpark.illinois.edu/job/2026-engineering-rotational-development-program-product-development-track/",
    "posted_date": "Fri, 22 Aug 2025 20:38:45 +0000",
    "published_parsed": [
      2025,
      8,
      22,
      20,
      38,
      45,
      4,
      234,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2020/05/Caterpillar-150x150.png",
    "description": "Description Career Area: Engineering Job Description: Your Work Shapes the World at Caterpillar Inc. When you join Caterpillar, you&#8217;re joining a global team who cares not just about the work we do – but also about each other. We are the makers, problem solvers, and future world builders who are creating stronger, more sustainable communities. We don&#8217;t just talk about progress and innovation here – we make it happen, with our customers, where we work and live. Together, we are building a better world, so we can all enjoy living in it. Start Your Career with Purpose Are you ready to apply your engineering education to real-world challenges? Caterpillar’s Engineering Rotational Development Program (ERDP) is designed for entry-level professionals like you. Through rotational assignments, you’ll continue developing your skills and knowledge—helping you achieve your career goals while contributing to Caterpillar’s mission of delivering exceptional products, services, and technologies to our customers. Our Engineering Rotational Development Program is an entry-level program designed to build employees’ skill sets within the discipline and continue growth, even after the successful completion of the program. This 12 to 18-month program provides practical experience across multiple engineering teams and technologies. It’s more than just a job, it’s a launchpad for your future at one of the world’s leading manufacturers of construction and mining equipment. What the Program Offers As part of the ERDP, you’ll rotate through different teams and projects that match your skills, knowledge, and abilities. You’ll work on meaningful projects, connect with mentors, and get exposure to various areas of the company. Here are just a few paths you might explore: Product Design: Design components and systems for Caterpillar products to meet customer needs. Collaborate with cross-functional teams throughout the value chain—from concept to production—to deliver effective solutions. Simulation/Performance Analysis: CFD [Computational Fluid Dynamics] (ANSYS), FEA [Finite Element Analysis], 3D modelling, autonomy sensor and photorealistic environment root cause investigation, system/subsystem/component design optimization, structural dynamics, development and optimization of engine, aftertreatment, battery, fuel cell, powertrain, machine system performance, and/or autonomy and multiple machine coordination. Test/Validation/Hands-on: Apply strong mechanical engineering understanding in a test/validation (hands-on) environment, troubleshooting issues, and collaborating with others for optimal results. Controls Development: Develop/implement control system algorithms using Matlab/Simulink for various control systems including, but not limited to, engine controllers, machine implement controllers, as well as powertrain controllers. Will be responsible for understanding the feature requirement, implementing it, as well as testing it prior to a production rollout. Electronic Components: Will be responsible for designing and testing various electronic control modules, as well as various electronic components. Will work with various internal Caterpillar clients to understand controller/component requirements, help design PCB [Printed Circuit Board] layouts, as well as perform digital/analog/power circuit analysis and testing. Other duties may include working with suppliers, testing the controllers/components in various environments, ensuring that FMEAs [Failure Mode and Effects Analysis] are conducted and documented to meet stringent Caterpillar quality requirements. Embedded Software Development: Develop embedded software in C, C#, and/or C++ for various electronic control modules. Some examples of embedded software development applications include Datalink communications, inputs and outputs (sensors and actuators), speed calculation, injection/spark timing, memory management, CPU optimization, multi-core design and implementation, autonomy algorithms for perception, localization, planning, etc. In addition, some areas of work include developing scripts in Python/Visual Basic for automation. Software Validation/Verification for Electronic Systems: Verify functionality of a feature or control system algorithm on a HIL [Hardware in the Loop] simulator bench or a SIL [Software in the Loop] system. Understand the requirements of the feature and/or the schematics of the controller/control system, verify functionality and debug/report anomalies to the development team, and help validate fixes. Engineering Data Analytics: Ability to write and understand computer code, Python, analytics/data science experience, exposure to machine learning concepts/tools, engineering and statistics fundamentals. Process Engineering: Apply mechanical, manufacturing, systems and/or industrial engineering knowledge to analyze and optimize an engineering process or processes. Will have the opportunity to leverage problem-solving and communication skills. What You Have – Skills and Experiences In this role, you will have the opportunity to contribute your unique skills and experiences. Below are some of the most critical skills: Analytical skills, initiating ideas, troubleshooting, root cause analysis, problem-solving, and critical thinking capabilities Knowledge of engineering principles, theory, and engineering experience gained through projects, internships, and/or relevant work experience Fundamental understanding of engineering for a manufacturing environment and the ability to design and implement materials, structures, machines, devices, systems, and processes that safely realize a desired objective or invention Ability to manage multiple projects simultaneously and quickly acquire and apply new skills and knowledge Collaborate with others of diverse cultures, interpersonal styles, and abilities Strong written and verbal communication skills Participate in and build on our inclusive, constructive, and productive work environment Ensure all team members’ contributions are recognized and valued This position requires 12 months or less of professional experience in this field (excluding internships) Program Qualifications ABET-accredited Bachelor’s or Master’s degree in Mechanical, Electrical, Computer, Agricultural, or Aerospace Engineering; Engineering Technology; or a related technical discipline (selected candidates must obtain their degree before they start) Minimum cumulative GPA of 3.0/4.0 or higher (unrounded) Willing to relocate and travel as needed Top Candidates May Also Have Involvement with a campus design/competition team or related experience Project or team leadership experience Previous technical internship/co-op or relevant experience Excellent interpersonal and communication skills Intellectual curiosity, adaptability, and a willingness to learn by doing Additional Information Please attach your resume and an unofficial copy of your transcript to your application Applicants will be considered for positions throughout the United States Most positions are based in Peoria, Illinois, with limited availability in other United States’ locations This is a Monday through Friday, in-person opportunity—perfect for building relationships, learning fast, and diving deep into your rotations Sponsorship is NOT available for this position Relocation is available to those who qualify 2026 available start dates – February 2, 2026; June 1, 2026; July 13, 2026; and August 3, 2026 (seats are limited for each start date) Why Choose Caterpillar? We’re a values-driven company where you’ll feel your work matters—whether you’re optimizing",
    "discovered_date": "2025-11-05T15:47:32.599141"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=46711",
    "company": "Mondelēz International",
    "position": "Research and Development Intern",
    "link": "https://researchpark.illinois.edu/job/research-and-development-intern/",
    "posted_date": "Wed, 13 Aug 2025 22:12:03 +0000",
    "published_parsed": [
      2025,
      8,
      13,
      22,
      12,
      3,
      2,
      225,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2020/05/Mondelez-150x150.png",
    "description": "About Mondelēz International As an organization we are committed to developing the next generation of Makers and Bakers. Joining us at an early career stage in our fast paced and ever-changing environment will enable you to do more, learn more and grow more. You will be encouraged to step outside your comfort zone – you may even surprise yourself! We will ensure you are given the support you need to be at your best and enable you to be yourself and bring passion and personality. Here you can lean in and speak up and bring your own flavour. About the Role In Research &#38; Development, the interns skills can be the special ingredient that brings Mondelēz&#8217;s brands to life. As part of a fantastic team of scientists, engineers, designers, modellers, and nutritionists, interns will work tirelessly on product design or development, process development, quality, nutrition, sensory and food safety aspects to ensure we deliver a consistent, delightful consumer experience. R&#38;D is where you’ll turn great ideas into brilliant brands. An internship within the R&#38;D areas such as Research, Product Development and Process Development. Research &#8211; Internships consist of working on projects related to the development of technology to enhance existing products or investigate new food concepts Product Development &#8211; Internships generally focus on formulation development to create new or improve existing products Process Development &#8211; Internships generally focus on the development of methods for converting raw materials into finished products, as well as continuous improvement of existing processes Data &#38; Digital – Internships consist of working on projects related to formulating business problems as data problems and work on solving them through systematic measurements and analysis, developing sensors, and employing machine learning, modelling, and data science methods wherever appropriate Mondelēz is looking for qualified individuals with a desire to work in the food industry and are interested in growing their problem solving, innovation, and analytical skills in a real-life research and development environment. Leadership, innovative thoughts, and a strong desire to learn are critical to succeed. Qualifications Pursuing a BS in combined degrees e.g. Computer Science + Philosophy, Computer Science &#38; Music, Business + Data Science, Computer Science + Crop Sciences. Pursuing a BS in Philosophy, Consumer Science, Computer Science, Material Science, Music/Music Science, Food Science, Physiology, Psychiatry, Statistics, Economics at the University of Illinois Urbana-Champaign Problem-Solving Time Management Drive for Results Functional/Technical Skills Interpersonal Savvy Able to travel (if required) Responsibilities During the placement the intern will be expected to plan and execute projects at various scales and depending on the scope may encompass hands-on practical work (e.g., benchtop and pilot plant, potentially within FutureLab, potentially within UIUC facilities, or potentially at Mondelez facilities at other locations.). Internships run during term time (part-time) and the summer vacations (full-time). Multiple positions are available, and hours are flexible (10 hours/week to 37.5 hours/week). Interns will be paid a competitive hourly wage. The positions are based out of Champaign, Illinois. We review applications on a first come, first served basis, and reserve the right to close our vacancies early &#8211; therefore we recommend that you complete and submit your application as soon as possible. To apply, please send a resume and cover letter outlining your qualifications and interest in the position to Michelle Firrell, Site Director, Mondelēz FutureLab, michelle.firrell@MDLZ.com.",
    "discovered_date": "2025-11-05T15:47:32.599142"
  },
  {
    "id": "https://researchpark.illinois.edu/?post_type=job_listing&p=46840",
    "company": "Caterpillar",
    "position": "2026 Corporate Parallel Co-op – Engineering",
    "link": "https://researchpark.illinois.edu/job/2026-corporate-parallel-co-op-engineering/",
    "posted_date": "Fri, 01 Aug 2025 20:23:52 +0000",
    "published_parsed": [
      2025,
      8,
      1,
      20,
      23,
      52,
      4,
      213,
      0
    ],
    "logo_url": "https://researchpark.illinois.edu/wp-content/uploads/2020/05/Caterpillar-150x150.png",
    "description": "Description Career Area: Students and Graduates Job Description: Your Work Shapes the World at Caterpillar Inc. When you join Caterpillar, you&#8217;re joining a global team who cares not just about the work we do – but also about each other. We are the makers, problem solvers, and future world builders who are creating stronger, more sustainable communities. We don&#8217;t just talk about progress and innovation here – we make it happen, with our customers, where we work and live. Together, we are building a better world, so we can all enjoy living in it. About the Role​ The Parallel Co-op Program is continuous employment for engineering/technology/computer science students focused on product development at Caterpillar. This is an early talent pipeline with the intent to find and develop the best talent. We strive to provide you with interesting work &#38; mentoring throughout the year, while you provide Caterpillar with some additional resources to complete valuable tasks at hand. Caterpillar pairs you with product development work teams on an annual basis, so you have the opportunity to work full-time in-person with the team during the summer and then work part-time throughout the school year. Parallel Co-Op Engineers work alongside engineering teams to complete design &#38; simulation tasks in support of Caterpillar product development in the following areas: Product Design: Engineer components &#38; systems for Caterpillar products to meet our customers’ needs. Deliver solutions by leading collaboration with cross functional teams throughout our value chain starting from the initial concept through production. Simulation/Performance Analysis: CFD &#8211; Computational Fluid Dynamics (ANSYS), FEA &#8211; Finite Element Analysis, 3D modelling, root cause investigation; system/subsystem/component design optimization, structural dynamics, development and optimization of Engine, Aftertreatment, Battery, Fuel Cell, Powertrain, and/or Machine System performance. Test/Validation/Hands on: Apply strong mechanical engineering understanding in a test/validation (hands-on) environment, troubleshooting issues, and collaborating with others for optimal results. Controls Development: Develop/Implement control system algorithms using Matlab/Simulink for various control systems including but not limited to engine controllers, machine implement controllers as well as powertrain controllers. Will be responsible for understanding the feature requirement, implementing it as well as testing it prior to a production roll out. Electronic Components: Will be responsible for designing and testing various electronic control modules as well as various electronic components. Will work with various internal Caterpillar clients to understand controller/component requirements, work with suppliers on design and validation of the components, as well as testing the components in various environments. Other duties may include design of Printed Circuit Board schematics as well as perform digital/analog/power circuit analysis and testing, and ensuring that FMEAs [Failure Mode and Effects Analysis] are conducted and documented to meet stringent Caterpillar quality requirements Embedded Software Development: Develop embedded software in C, C# and/or C++ for various electronic control modules. Some examples of embedded software development applications include Datalink communications, Inputs and Outputs [Sensors and actuators], speed calculation, Injection/spark timing, memory management, CPU optimization, multi core design and implementation etc. In addition, some areas of work include developing scripts in Python/Visual Basic for automation. Software Validation/Verification for Electronic Systems: Verify functionality of a feature or control system algorithm on a HIL [Hardware in the Loop] simulator bench or a SIL [Software in the loop] system. Understand requirements of the feature and/or the schematics of the controller/control system, verify functionality and debug/report anomalies to the development team and help validate fixes. Engineering Data Analytics: Ability to write and understand computer code; Python; analytics/data science experience; exposure to machine learning concepts/tools; engineering and statistics fundamentals. Process Engineering: Process Engineering: Apply mechanical, manufacturing, systems and/or industrial engineering knowledge to analyze and optimize an engineering process or processes. Will have the opportunity to leverage problem-solving and communication skills. What You Have – Skills and Experiences In this role, you will have the opportunity to contribute your unique skills and experiences. Below are some of the most critical skills. Analytical skills, initiating ideas, troubleshooting, root cause analysis, problem-solving, and critical thinking capabilities Knowledge of engineering principles, theory, and engineering experience gained through projects, internships, and/or relevant work experiences Fundamental understanding of engineering for a manufacturing environment, ability to design and implement materials, structures, machines, devices, systems and processes that safely realize a desired objective or invention Organize and manage multiple projects simultaneously, ability to quickly gain, and effectively apply new skills &#38; knowledge Success in collaborating with others of diverse cultures, interpersonal styles, and abilities Strong written and verbal communication skills Co-Op Program Qualifications: Must be enrolled full-time in a 4-year university/college pursuing an ABET accredited degree in Mechanical, Electrical, Computer, Agricultural or Aerospace Engineering or Engineering Technology at the time of application and throughout the program. Minimum 3.0/4.0 Cumulative Grade Point Average (no rounding) at current institution Top candidates will also have: Management experience Previous technical internship, co-op, or research/relevant experience Current intern or trainee at Caterpillar Additional Information: Please attach your resume and an unofficial copy of your transcript to your application. This is a part-time, temporary position. Sponsorship is NOT available Locations include the Peoria, Illinois area, Champaign and Decatur, Illinois, West Lafayette/Lafayette, Indiana and Tucson, Arizona During the summer, this position requires working onsite five days a week at the assigned location. During the school year this position requires students attending University of Illinois, Purdue University, &#38; The Ohio State University to work at the local campus office on days they work. Summary Pay Range: $25.00 &#8211; $43.00* *Hourly Rate is based on the major/degree being pursued and the number of completed academic hours achieved prior to the start of the Co-op. Final details: Please frequently check the email associated with your application, including the junk/spam folder, as this is the primary correspondence method. If you wish to know the status of your application – please use the candidate log-in on our career website as it will reflect any updates to your status. Qualified applicants of any age are encouraged to apply. For more information, visit caterpillar.com. To connect with us on social media, visit caterpillar.com/social-media. Summary Pay Range: $25.00 &#8211; $43.00 Intern Hour Rate: An intern&#8217;s hourly rate is based on the major/degree",
    "discovered_date": "2025-11-05T15:47:32.599143"
  }
]